---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSliverSpaceTolerance(System.Double)
source: html/ea90ab77-c7f4-66aa-0b63-906d5281dd31.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSliverSpaceTolerance Method

Checks that the sliver space tolerance is greater than or equal to zero.

## Syntax (C#)
```csharp
public static bool CheckRangeOfSliverSpaceTolerance(
	double silverSpaceTolerance
)
```

## Parameters
- **silverSpaceTolerance** (`System.Double`) - The sliver space tolerance to be checked.

## Returns
Returns true if the sliver space tolerance is greater than or equal to zero, false otherwise.